#pragma once

#include <string>
#include <string_view>

namespace svarg::cxx {

// возвращает строку которую можно использовать как идентификатор в С++
// гарантирует уникалный идентификатор на каждую строку (ценой того что Z используется как escape символ)
std::string to_cxx_ident(std::string_view);

// возвращает строку которую можно использовать как идентификатор в С++
// НЕ гарантирует уникальный выход, т.е. две строки могут дать один идентификатор
// просто все символы запрещённые в С++ преобразует в '_'
std::string to_cxx_ident_simple(std::string_view);

}  // namespace svarg::cxx
